result/flames/00_THP/benchmark-stats.log
  240000000 requests completed in 351.42 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.09% <= 2 milliseconds
21.88% <= 3 milliseconds
84.45% <= 4 milliseconds
95.60% <= 5 milliseconds
99.89% <= 6 milliseconds
99.94% <= 7 milliseconds
99.94% <= 8 milliseconds
99.96% <= 9 milliseconds
99.96% <= 10 milliseconds
99.96% <= 11 milliseconds
99.97% <= 12 milliseconds
99.97% <= 13 milliseconds
99.97% <= 14 milliseconds
99.97% <= 15 milliseconds
99.97% <= 16 milliseconds
99.97% <= 17 milliseconds
99.97% <= 18 milliseconds
99.97% <= 19 milliseconds
99.97% <= 21 milliseconds
99.97% <= 22 milliseconds
99.97% <= 23 milliseconds
99.97% <= 24 milliseconds
99.98% <= 25 milliseconds
99.98% <= 26 milliseconds
99.98% <= 27 milliseconds
99.98% <= 28 milliseconds
99.98% <= 30 milliseconds
99.98% <= 31 milliseconds
99.98% <= 32 milliseconds
99.98% <= 33 milliseconds
99.98% <= 34 milliseconds
99.98% <= 35 milliseconds
99.98% <= 36 milliseconds
99.98% <= 37 milliseconds
99.98% <= 38 milliseconds
99.98% <= 39 milliseconds
99.98% <= 40 milliseconds
99.98% <= 41 milliseconds
99.98% <= 42 milliseconds
99.98% <= 44 milliseconds
99.98% <= 45 milliseconds
99.98% <= 46 milliseconds
99.98% <= 48 milliseconds
99.98% <= 49 milliseconds
99.98% <= 50 milliseconds
99.98% <= 51 milliseconds
99.98% <= 54 milliseconds
99.98% <= 55 milliseconds
99.98% <= 56 milliseconds
99.98% <= 57 milliseconds
99.98% <= 58 milliseconds
99.98% <= 62 milliseconds
99.98% <= 68 milliseconds
99.98% <= 69 milliseconds
99.98% <= 70 milliseconds
99.98% <= 71 milliseconds
99.98% <= 72 milliseconds
99.98% <= 73 milliseconds
99.98% <= 74 milliseconds
99.98% <= 75 milliseconds
99.98% <= 76 milliseconds
99.98% <= 78 milliseconds
99.98% <= 79 milliseconds
99.98% <= 81 milliseconds
99.98% <= 86 milliseconds
99.98% <= 88 milliseconds
99.98% <= 89 milliseconds
99.98% <= 91 milliseconds
99.98% <= 96 milliseconds
99.99% <= 97 milliseconds
99.99% <= 102 milliseconds
99.99% <= 104 milliseconds
99.99% <= 106 milliseconds
99.99% <= 107 milliseconds
99.99% <= 109 milliseconds
99.99% <= 111 milliseconds
99.99% <= 112 milliseconds
99.99% <= 120 milliseconds
99.99% <= 126 milliseconds
99.99% <= 131 milliseconds
99.99% <= 132 milliseconds
99.99% <= 134 milliseconds
99.99% <= 136 milliseconds
99.99% <= 137 milliseconds
99.99% <= 138 milliseconds
99.99% <= 141 milliseconds
99.99% <= 143 milliseconds
99.99% <= 144 milliseconds
99.99% <= 146 milliseconds
99.99% <= 148 milliseconds
99.99% <= 152 milliseconds
99.99% <= 153 milliseconds
99.99% <= 154 milliseconds
99.99% <= 155 milliseconds
99.99% <= 157 milliseconds
99.99% <= 159 milliseconds
99.99% <= 163 milliseconds
99.99% <= 164 milliseconds
99.99% <= 168 milliseconds
99.99% <= 169 milliseconds
99.99% <= 182 milliseconds
99.99% <= 185 milliseconds
99.99% <= 193 milliseconds
99.99% <= 194 milliseconds
99.99% <= 196 milliseconds
99.99% <= 201 milliseconds
99.99% <= 202 milliseconds
99.99% <= 203 milliseconds
99.99% <= 205 milliseconds
99.99% <= 209 milliseconds
99.99% <= 218 milliseconds
99.99% <= 219 milliseconds
99.99% <= 222 milliseconds
99.99% <= 224 milliseconds
99.99% <= 226 milliseconds
99.99% <= 228 milliseconds
99.99% <= 242 milliseconds
99.99% <= 248 milliseconds
99.99% <= 252 milliseconds
99.99% <= 281 milliseconds
99.99% <= 282 milliseconds
99.99% <= 297 milliseconds
99.99% <= 299 milliseconds
99.99% <= 304 milliseconds
99.99% <= 306 milliseconds
99.99% <= 310 milliseconds
99.99% <= 312 milliseconds
99.99% <= 316 milliseconds
99.99% <= 317 milliseconds
99.99% <= 327 milliseconds
99.99% <= 329 milliseconds
99.99% <= 334 milliseconds
99.99% <= 338 milliseconds
99.99% <= 340 milliseconds
99.99% <= 350 milliseconds
99.99% <= 368 milliseconds
99.99% <= 383 milliseconds
99.99% <= 388 milliseconds
99.99% <= 389 milliseconds
99.99% <= 391 milliseconds
99.99% <= 396 milliseconds
99.99% <= 414 milliseconds
99.99% <= 421 milliseconds
99.99% <= 441 milliseconds
99.99% <= 442 milliseconds
99.99% <= 450 milliseconds
99.99% <= 465 milliseconds
99.99% <= 468 milliseconds
99.99% <= 470 milliseconds
99.99% <= 495 milliseconds
99.99% <= 508 milliseconds
99.99% <= 511 milliseconds
99.99% <= 514 milliseconds
99.99% <= 525 milliseconds
99.99% <= 527 milliseconds
99.99% <= 529 milliseconds
99.99% <= 538 milliseconds
99.99% <= 559 milliseconds
99.99% <= 567 milliseconds
99.99% <= 578 milliseconds
99.99% <= 582 milliseconds
99.99% <= 609 milliseconds
99.99% <= 628 milliseconds
99.99% <= 657 milliseconds
99.99% <= 673 milliseconds
100.00% <= 708 milliseconds
100.00% <= 709 milliseconds
100.00% <= 717 milliseconds
100.00% <= 733 milliseconds
100.00% <= 742 milliseconds
100.00% <= 745 milliseconds
100.00% <= 763 milliseconds
100.00% <= 764 milliseconds
100.00% <= 770 milliseconds
100.00% <= 779 milliseconds
100.00% <= 782 milliseconds
100.00% <= 784 milliseconds
100.00% <= 827 milliseconds
100.00% <= 847 milliseconds
100.00% <= 873 milliseconds
100.00% <= 906 milliseconds
100.00% <= 931 milliseconds
100.00% <= 950 milliseconds
100.00% <= 953 milliseconds
100.00% <= 961 milliseconds
100.00% <= 977 milliseconds
100.00% <= 995 milliseconds
100.00% <= 1014 milliseconds
100.00% <= 1022 milliseconds
100.00% <= 1044 milliseconds
100.00% <= 1060 milliseconds
100.00% <= 1061 milliseconds
100.00% <= 1081 milliseconds
100.00% <= 1092 milliseconds
100.00% <= 1094 milliseconds
100.00% <= 1123 milliseconds
100.00% <= 1124 milliseconds
100.00% <= 1142 milliseconds
100.00% <= 1155 milliseconds
100.00% <= 1161 milliseconds
100.00% <= 1170 milliseconds
100.00% <= 1188 milliseconds
100.00% <= 1242 milliseconds
100.00% <= 1244 milliseconds
100.00% <= 1269 milliseconds
100.00% <= 1301 milliseconds
100.00% <= 1315 milliseconds
100.00% <= 1339 milliseconds
100.00% <= 1363 milliseconds
100.00% <= 1386 milliseconds
100.00% <= 1395 milliseconds
100.00% <= 1409 milliseconds
100.00% <= 1486 milliseconds
100.00% <= 1487 milliseconds
100.00% <= 1488 milliseconds
100.00% <= 1488 milliseconds
682943.44 requests per second